Tekla Open API Reference for Tekla Structures 2025
InvalidFilterExpressionException Class
 The InvalidFilterExpressionException class represents an error that occurred during the expression evaluation. This class cannot be inherited.
Inheritance Hierarchy
System.Object
 System.Exception
 Tekla.Structures.Filtering.InvalidFilterExpressionException
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class InvalidFilterExpressionException : Exception
<SerializableAttribute>
Public NotInheritable Class InvalidFilterExpressionException
	Inherits Exception
The InvalidFilterExpressionException type exposes the following members.
Constructors
Name | Description
InvalidFilterExpressionException(Expression, InvalidFilterExpressionExceptionReasonsType)
 Initializes a new instance of the InvalidFilterExpressionException class.
InvalidFilterExpressionException(Expression, InvalidFilterExpressionExceptionReasonsType, Int32)
 Initializes a new instance of the InvalidFilterExpressionException class.
InvalidFilterExpressionException(Expression, OperatorType, Expression, InvalidFilterExpressionExceptionReasonsType)
 Initializes a new instance of the InvalidFilterExpressionException class.
Top
Properties
Name | Description
Expression
 Gets the invalid expression.
InvalidFilterExpressionExceptionReasonsType
 Gets the reason why the exception is thrown.
LeftExpression
 Gets the invalid expression's left operand.
OperatorType
 Gets the invalid expression's operator.
RightExpression
 Gets the invalid expression's right operand.
Top
See Also
Reference
Tekla.Structures.Filtering Namespace